In [1]:
import pandas as pd

In [24]:
df=pd.read_csv("Chicago_city.csv")

In [3]:
df

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00
...,...,...,...,...
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$87384.00
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00
32062,NaN,NaN,NaN,NaN

In [7]:
df["Department"].str.lower()

0             water mgmnt
1                  police
2                  police
3        general services
4             water mgmnt
               ...
32058              police
32059              police
32060              police
32061                doit
32062                 NaN
Name: Department, Length: 32063, dtype: object

In [15]:
df["Employee Annual Salary"]=df["Employee Annual Salary"].str.replace("$","")

C:\Users\miles\AppData\Local\Temp\ipykernel_8376\1758621223.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df["Employee Annual Salary"]=df["Employee Annual Salary"].str.replace("$","")

In [20]:
df["Employee Annual Salary"]=df["Employee Annual Salary"].astype(float)

In [46]:
df1=pd.read_csv("Chicago_city.csv",index_col=["Position Title"])

In [47]:
df1

,Name,Department,Employee Annual Salary
Position Title,,,
WATER RATE TAKER,"AARON, ELVIA J",WATER MGMNT,$90744.00
POLICE OFFICER,"AARON, JEFFERY M",POLICE,$84450.00
POLICE OFFICER,"AARON, KARINA",POLICE,$84450.00
CHIEF CONTRACT EXPEDITER,"AARON, KIMBERLEI R",GENERAL SERVICES,$89880.00
CIVIL ENGINEER IV,"ABAD JR, VICENTE M",WATER MGMNT,$106836.00
...,...,...,...
POLICE OFFICER,"ZYGOWICZ, PETER J",POLICE,$87384.00
POLICE OFFICER,"ZYMANTAS, MARK E",POLICE,$84450.00
POLICE OFFICER,"ZYRKOWSKI, CARLO E",POLICE,$87384.00
CHIEF DATA BASE ANALYST,"ZYSKOWSKI, DARIUSZ",DoIT,$113664.00
NaN,NaN,NaN,NaN

In [48]:
df1.index=df1.index.str.lower()

In [49]:
df1

,Name,Department,Employee Annual Salary
Position Title,,,
water rate taker,"AARON, ELVIA J",WATER MGMNT,$90744.00
police officer,"AARON, JEFFERY M",POLICE,$84450.00
police officer,"AARON, KARINA",POLICE,$84450.00
chief contract expediter,"AARON, KIMBERLEI R",GENERAL SERVICES,$89880.00
civil engineer iv,"ABAD JR, VICENTE M",WATER MGMNT,$106836.00
...,...,...,...
police officer,"ZYGOWICZ, PETER J",POLICE,$87384.00
police officer,"ZYMANTAS, MARK E",POLICE,$84450.00
police officer,"ZYRKOWSKI, CARLO E",POLICE,$87384.00
chief data base analyst,"ZYSKOWSKI, DARIUSZ",DoIT,$113664.00
NaN,NaN,NaN,NaN

In [54]:
df1.index=df1.index.str.replace(" ","-")

In [55]:
df1

,Name,Department,Employee Annual Salary
Position Title,,,
water-rate-taker,"AARON, ELVIA J",WATER MGMNT,$90744.00
police-officer,"AARON, JEFFERY M",POLICE,$84450.00
police-officer,"AARON, KARINA",POLICE,$84450.00
chief-contract-expediter,"AARON, KIMBERLEI R",GENERAL SERVICES,$89880.00
civil-engineer-iv,"ABAD JR, VICENTE M",WATER MGMNT,$106836.00
...,...,...,...
police-officer,"ZYGOWICZ, PETER J",POLICE,$87384.00
police-officer,"ZYMANTAS, MARK E",POLICE,$84450.00
police-officer,"ZYRKOWSKI, CARLO E",POLICE,$87384.00
chief-data-base-analyst,"ZYSKOWSKI, DARIUSZ",DoIT,$113664.00
NaN,NaN,NaN,NaN

In [85]:
s=df1.index[0]

In [86]:
s

'water-rate-taker'

In [87]:
s.split("-")[0]

'water'

In [100]:
df1.index.str.split("-")

Index([                       ['water', 'rate', 'taker'],
                                   ['police', 'officer'],
                                   ['police', 'officer'],
                      ['chief', 'contract', 'expediter'],
                             ['civil', 'engineer', 'iv'],
                       ['asst', 'to', 'the', 'alderman'],
                   ['general', 'laborer', '', '', 'dss'],
                ['traffic', 'control', 'aide', 'hourly'],
              ['staff', 'asst', 'to', 'the', 'alderman'],
                              ['electrical', 'mechanic'],
       ...
                                  ['firefighter', 'emt'],
                                   ['police', 'officer'],
                                   ['police', 'officer'],
                           ['machinist', '(automotive)'],
       ['frm', 'of', 'machinists', '', '', 'automotive'],
                                   ['police', 'officer'],
                                   ['police', 'officer'],
                                   ['police', 'officer'],
                    ['chief', 'data', 'base', 'analyst'],
                                                     nan],
      dtype='object', name='Position Title', length=32063)

In [107]:
dff=df1.index.str.split("-").str.get(0)

In [108]:
dff

Index([      'water',      'police',      'police',       'chief',
             'civil',        'asst',     'general',     'traffic',
             'staff',  'electrical',
       ...
       'firefighter',      'police',      'police',   'machinist',
               'frm',      'police',      'police',      'police',
             'chief',           nan],
      dtype='object', name='Position Title', length=32063)

In [109]:
# dept mgment -> management 
# words ending with 'ment' -> count

In [114]:
df1["Department"]=df1["Department"].str.replace("MGMNT","MANAGMENT")

In [115]:
df1

,Name,Department,Employee Annual Salary
Position Title,,,
water-rate-taker,"AARON, ELVIA J",WATER MANAGMENT,$90744.00
police-officer,"AARON, JEFFERY M",POLICE,$84450.00
police-officer,"AARON, KARINA",POLICE,$84450.00
chief-contract-expediter,"AARON, KIMBERLEI R",GENERAL SERVICES,$89880.00
civil-engineer-iv,"ABAD JR, VICENTE M",WATER MANAGMENT,$106836.00
...,...,...,...
police-officer,"ZYGOWICZ, PETER J",POLICE,$87384.00
police-officer,"ZYMANTAS, MARK E",POLICE,$84450.00
police-officer,"ZYRKOWSKI, CARLO E",POLICE,$87384.00
chief-data-base-analyst,"ZYSKOWSKI, DARIUSZ",DoIT,$113664.00
NaN,NaN,NaN,NaN

In [123]:
sum(df1["Department"].str.endswith("MENT")==True)

2131

In [124]:
df1["Department"].str.endswith("MENT").value_counts()

False    29931
True      2131
Name: Department, dtype: int64